# Lesson 4

Almost no differences from the guide. This lesson was short and simple.


This lesson is about: 
* adding columns, 
* deleting columns
* slicing the data many different ways

In [1]:
# Import libraries
import pandas as pd
import sys

In [2]:
# Our small data set
d = [0,1,2,3,4,5,6,7,8,9]

# Create dataframe
df = pd.DataFrame(d)
# Lets change the name of the column
df.columns = ['Rev']
df

   Rev
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9

In [3]:
# Lets add a column
df['NewCol'] = 5
df

   Rev  NewCol
0    0       5
1    1       5
2    2       5
3    3       5
4    4       5
5    5       5
6    6       5
7    7       5
8    8       5
9    9       5

In [4]:
# Lets modify our new column
df['NewCol'] = df['NewCol'] + 1
df

   Rev  NewCol
0    0       6
1    1       6
2    2       6
3    3       6
4    4       6
5    5       6
6    6       6
7    7       6
8    8       6
9    9       6

In [5]:
# We can delete columns
del df['NewCol']
df

   Rev
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9

In [6]:
# Lets add a couple of columns
df['test'] = 3
df['col'] = df['Rev']
df

   Rev  test  col
0    0     3    0
1    1     3    1
2    2     3    2
3    3     3    3
4    4     3    4
5    5     3    5
6    6     3    6
7    7     3    7
8    8     3    8
9    9     3    9

In [7]:
# If we wanted, we could change the name of the index
i = ['a','b','c','d','e','f','g','h','i','j']
# power of index array must be equal to number of rows in target dataset
df.index = i
df

   Rev  test  col
a    0     3    0
b    1     3    1
c    2     3    2
d    3     3    3
e    4     3    4
f    5     3    5
g    6     3    6
h    7     3    7
i    8     3    8
j    9     3    9

In [8]:
# We can now start to select pieces of the dataframe using loc.
df.loc['a']

Rev     0
test    3
col     0
Name: a, dtype: int64

In [9]:
# df.loc[inclusive:inclusive]
df.loc['a':'d']

   Rev  test  col
a    0     3    0
b    1     3    1
c    2     3    2
d    3     3    3

In [10]:
# df.iloc[inclusive:exclusive]
# Note: .iloc is strictly integer position based. It is available from [version 0.11.0] (http://pandas.pydata.org/pandas-docs/stable/whatsnew.html#v0-11-0-april-22-2013) 
df.iloc[0:6]

   Rev  test  col
a    0     3    0
b    1     3    1
c    2     3    2
d    3     3    3
e    4     3    4
f    5     3    5

In [11]:
# We can also select using the column name.
df['Rev']

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
Name: Rev, dtype: int64

In [12]:
df[['Rev', 'test']]

   Rev  test
a    0     3
b    1     3
c    2     3
d    3     3
e    4     3
f    5     3
g    6     3
h    7     3
i    8     3
j    9     3

In [13]:
# df.ix[rows,columns]
# replaces the deprecated ix function
#df.ix[0:3,'Rev']
df.loc[df.index[0:3],'Rev']

a    0
b    1
c    2
Name: Rev, dtype: int64

In [14]:
# replaces the deprecated ix function
#df.ix[5:,'col']
df.loc[df.index[5:],'col']

f    5
g    6
h    7
i    8
j    9
Name: col, dtype: int64

In [15]:
# replaces the deprecated ix function
#df.ix[:3,['col', 'test']]
df.loc[df.index[:3],['col', 'test']]

   col  test
a    0     3
b    1     3
c    2     3

In [16]:
%reset

Once deleted, variables cannot be recovered. Proceed (y/[n])? y

---

# Lesson 5

We will be taking a brief look at the stack and unstack functions.

In [17]:
# Import libraries
import pandas as pd
import sys

In [18]:
# Our small data set
d = {'one':[1,1],'two':[2,2]}
i = ['a','b']

# Create dataframe
df = pd.DataFrame(data = d, index = i)
df

   one  two
a    1    2
b    1    2

In [19]:
df.index

Index(['a', 'b'], dtype='object')

In [20]:
# Bring the columns and place them in the index
stack = df.stack()
stack

a  one    1
   two    2
b  one    1
   two    2
dtype: int64

In [21]:
# The index now includes the column names
stack.index

MultiIndex([('a', 'one'),
            ('a', 'two'),
            ('b', 'one'),
            ('b', 'two')],
           )

In [22]:
unstack = df.unstack()
unstack

one  a    1
     b    1
two  a    2
     b    2
dtype: int64

In [23]:
unstack.index

MultiIndex([('one', 'a'),
            ('one', 'b'),
            ('two', 'a'),
            ('two', 'b')],
           )

In [24]:
transpose = df.T
transpose

     a  b
one  1  1
two  2  2

In [25]:
transpose.index

Index(['one', 'two'], dtype='object')

---
# Lesson 6

Lets take a look at the groupby function.

In [26]:
# Our small data set
d = {'one':[1,1,1,1,1],
     'two':[2,2,2,2,2],
     'letter':['a','a','b','b','c']}

# Create dataframe
df = pd.DataFrame(d)
df

   one  two letter
0    1    2      a
1    1    2      a
2    1    2      b
3    1    2      b
4    1    2      c

In [27]:
# Create group object
one = df.groupby('letter')
one

In [28]:
# Apply sum function
one.sum()

        one  two
letter
a         2    4
b         2    4
c         1    2

In [29]:
letterone = df.groupby(['letter','one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [30]:
letterone.index

MultiIndex([('a', 1),
            ('b', 1),
            ('c', 1)],
           names=['letter', 'one'])

In [31]:
#You may want to not have the columns you are grouping by become your index
letterone = df.groupby(['letter','one'], as_index=False).sum()
letterone

  letter  one  two
0      a    1    4
1      b    1    4
2      c    1    2

In [32]:
letterone.index

Int64Index([0, 1, 2], dtype='int64')